Black8Mamba/IMXRT1052_for_fireboard/component/uart/fsl_adapter_lpuart.c
#if defined(LPUART0)
#if !(defined(FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1) && FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART0_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(0);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART0_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(0);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM0)
void LP_FLEXCOMM0_IRQHandler(void);
void LP_FLEXCOMM0_IRQHandler(void)
#else /* LP_FLEXCOMM0 */
void LPUART0_IRQHandler(void);
void LPUART0_IRQHandler(void)
#endif /* LP_FLEXCOMM0 */
{
    HAL_UartInterruptHandle(0);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ */
#endif /* FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1 */
#endif /* LPUART0 */

#if defined(LPUART1)
#if !(defined(FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1) && FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART1_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(1);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART1_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(1);
    SDK_ISR_EXIT_BARRIER;
}
#else  /* FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ */
#if defined(LP_FLEXCOMM1)
void LP_FLEXCOMM1_IRQHandler(void);
void LP_FLEXCOMM1_IRQHandler(void)
#else /* LP_FLEXCOMM1 */
void LPUART1_IRQHandler(void);
void LPUART1_IRQHandler(void)
#endif /* LP_FLEXCOMM1 */
{
    HAL_UartInterruptHandle(1);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ */
#endif /* FSL_FEATURE_LPUART_HAS_SHARED_IRQ0_IRQ1 */
#endif /* LPUART1 */

#if defined(LPUART2)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART2_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(2);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART2_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(2);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM2)
void LP_FLEXCOMM2_IRQHandler(void);
void LP_FLEXCOMM2_IRQHandler(void)
#else /* LP_FLEXCOMM2 */
void LPUART2_IRQHandler(void);
void LPUART2_IRQHandler(void)
#endif /* LP_FLEXCOMM2 */
{
    HAL_UartInterruptHandle(2);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART2 */

#if defined(LPUART3)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART3_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(3);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART3_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(3);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM3)
void LP_FLEXCOMM3_IRQHandler(void);
void LP_FLEXCOMM3_IRQHandler(void)
#else /* LP_FLEXCOMM3 */
void LPUART3_IRQHandler(void);
void LPUART3_IRQHandler(void)
#endif /* LP_FLEXCOMM3 */
{
    HAL_UartInterruptHandle(3);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART3 */

#if defined(LPUART4)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART4_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(4);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART4_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(4);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM4)
void LP_FLEXCOMM4_IRQHandler(void);
void LP_FLEXCOMM4_IRQHandler(void)
#else /* LP_FLEXCOMM4 */
void LPUART4_IRQHandler(void);
void LPUART4_IRQHandler(void)
#endif /* LP_FLEXCOMM4 */
{
    HAL_UartInterruptHandle(4);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART4 */

#if defined(LPUART5)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART5_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(5);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART5_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(5);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM5)
void LP_FLEXCOMM5_IRQHandler(void);
void LP_FLEXCOMM5_IRQHandler(void)
#else /* LP_FLEXCOMM5 */
void LPUART5_IRQHandler(void);
void LPUART5_IRQHandler(void)
#endif /* LP_FLEXCOMM5 */
{
    HAL_UartInterruptHandle(5);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART5 */

#if defined(LPUART6)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART6_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(6);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART6_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(6);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM6)
void LP_FLEXCOMM6_IRQHandler(void);
void LP_FLEXCOMM6_IRQHandler(void)
#else /* LP_FLEXCOMM6 */
void LPUART6_IRQHandler(void);
void LPUART6_IRQHandler(void)
#endif /* LP_FLEXCOMM6 */
{
    HAL_UartInterruptHandle(6);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART6 */

#if defined(LPUART7)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART7_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(7);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART7_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(7);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM7)
void LP_FLEXCOMM7_IRQHandler(void);
void LP_FLEXCOMM7_IRQHandler(void)
#else /* LP_FLEXCOMM7 */
void LPUART7_IRQHandler(void);
void LPUART7_IRQHandler(void)
#endif /* LP_FLEXCOMM7 */
{
    HAL_UartInterruptHandle(7);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART7 */

#if defined(LPUART8)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART8_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(8);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART8_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(8);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM8)
void LP_FLEXCOMM8_IRQHandler(void);
void LP_FLEXCOMM8_IRQHandler(void)
#else /* LP_FLEXCOMM8 */
void LPUART8_IRQHandler(void);
void LPUART8_IRQHandler(void)
#endif /* LP_FLEXCOMM8 */
{
    HAL_UartInterruptHandle(8);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART8 */

#if defined(LPUART9)
#if defined(FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ) && FSL_FEATURE_LPUART_HAS_SEPARATE_RX_TX_IRQ
void LPUART9_TX_IRQHandler(void)
{
    HAL_UartInterruptHandle(9);
    SDK_ISR_EXIT_BARRIER;
}
void LPUART9_RX_IRQHandler(void)
{
    HAL_UartInterruptHandle(9);
    SDK_ISR_EXIT_BARRIER;
}
#else
#if defined(LP_FLEXCOMM9)
void LP_FLEXCOMM9_IRQHandler(void);
void LP_FLEXCOMM9_IRQHandler(void)
#else /* LP_FLEXCOMM9 */
void LPUART9_IRQHandler(void);
void LPUART9_IRQHandler(void)
#endif /* LP_FLEXCOMM9 */
{
    HAL_UartInterruptHandle(9);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif /* LPUART9 */

